{
  "articles": [
    { "id": "1", 
      "title": "ICT",
      "rol": "adviseren",
      "text": "<p><span><b>ICT</b></span>, or information and communications technology (or technologies), is the infrastructure and components that enable modern computing.\n\nAlthough there is no single, universal definition of ICT, the term is generally accepted to mean all devices, networking components, applications and systems that combined allow people and organizations (i.e., businesses, nonprofit agencies, governments and criminal enterprises) to interact in the digital world.\n\nComponents of an ICT system\nICT encompasses both the internet-enabled sphere as well as the mobile one powered by wireless networks. It also includes antiquated technologies, such as landline telephones, radio and television broadcast -- all of which are still widely used today alongside cutting-edge ICT pieces such as artificial intelligence and robotics.\n\nICT is sometimes used synonymously with IT (for information technology); however, ICT is generally used to represent a broader, more comprehensive list of all components related to computer and digital technologies than IT.\n\nThe list of ICT components is exhaustive, and it continues to grow. Some components, such as computers and telephones, have existed for decades. Others, such as smartphones, digital TVs and robots, are more recent entries.\n\nICT commonly means more than its list of components, though. It also encompasses the application of all those various components. It's here that the real potential, power and danger of ICT can be found.</p>", 
      "geschiedenis"  : [
          {
            "time": "20:21:30",
            "date": "2020-10-01",
            "editor": {
              "username": "anon123"
            },
            "title": "advice geven",
            "tekst": "test tekst test tekst test tekst"            
          }, 

          {
            "time": "22:10:33",
            "date": "2020-09-28",
            "editor": {
              "username": "anon123"
            },
            "title": "giving advice",
            "tekst": "test tekst test tekst"
          }
      ]
    },
    { "id": "2", "title": "Domeinklasse", "rol": "adviseren", "text": "Neem als uitgangspunt alle use case scenario's of ieder document dat beschrijft wat het systeem moet doen (requirementsdocumenten).\nMarkeer door bijv te onderstrepen ieder zelfstandignaamwoord die je kunt vinden is in de verzamelde documenten. Maak je in dit stadium nog geen zorgen over de naamgeving. Dit zijn kandidaten klassen.\nMaak een lijst van de gevonden naamwoorden en rangschik deze naar betekenis. Van de namen die dezelfde betekenis hebben gebruik slechts 1.\nMaak van de gereduceerde lijst een diagram (rechthoek met de naam van de klasse er in).\nTeken de relaties tussen de klassen door een lijn te trekken tussen elke twee klassen die een relatie hebben. Twee klassen hebben een relatie met elkaar als er een zin bestaat (of te maken) waarin die twee klassen voor komen. Met enig kennis over het te maken systeem zijn de relaties redelijk eenvoudig te vinden.\nOm de methodes behorende bij een klasse te vinden, neem je als uitgangspunt dezelfde documenten en ga je nu opzoek naar de werkwoorden (acties) in deze documenten. Dit zijn de kandidaten methoden\nOm te bepalen bij welke klassen deze kandidaten methoden horen stel je de vraag welke klasse is verantwoordelijk voor welke actie. Net als voor de kandidatenklassen rangschik je de acties naar betekenis." },
    { "id": "3", "title": "Domein ICT", "rol": "adviseren", "text": "ICT Domein is een onderwerp wat veel lijkt op domeinklasse gg." },

    { "id": "4", "title": "Use case diagram", "rol": "realiseren", "text": "Wat tekst hier en daar hoort erbij"},
    { "id": "5", "title": "Use case template", "rol": "realiseren","text": "Ja een use case template natuurlijk nice."},
    { "id": "6", "title": "Activity diagram", "rol": "realiseren", "text": "Activity diagram is hier wel handig"},

    { "id": "7", "title": "Java", "rol": "ontwerpen", "text": "Java leukste taal natuurlijk om mee te programmeren" },
    { "id": "8", "title": "Python", "rol": "ontwerpen", "text": "Python, leuke taal 3 maanden maar gehad, mocht langer!" },
    { "id": "9", "title": "CSS", "rol": "ontwerpen", "text": "CSS zijn we nu mee bezig." },

    { "id": "10", "title": "HTML", "rol": "analyseren", "text": "HTML mag geen programmeertaal genoemd worden"},
    { "id": "11", "title": "JavaScript", "rol": "analyseren", "text": "JavaScript goeie. Het is zeker een veelgebruikte taal."},
    { "id": "12", "title": "Hibernate", "rol": "analyseren", "text": "Hibernate hebben we niet lang gehad, max 2 week."},

    { "id": "13", "title": "User Stories", "rol": "manage & control", "text": "User stories zijn handig om dingen te doen"},
    { "id": "14", "title": "BPMN", "rol": "manage & control", "text": "BPMN Modellen worden vaak gebruikt in het zakenleven."},
    { "id": "15", "title": "Actor Templates", "rol": "manage & control", "text": "Actor templates om even alle actoren in beeld te brengen."}
  ]
}