{
  "id":"gebruikers_interface",
  "name": "Gebruikers Interface",
  "artikelen": [
    { "id": "1", "title": "ICT", "rol": "analyseren", "text": "<b>Informatietechnologie (IT) of informatie- en communicatietechnologie (ICT)</b> is een vakgebied dat zich bezighoudt met informatiesystemen, telecommunicatie en computers. Hieronder valt het ontwikkelen en beheren van systemen, netwerken, databases en websites. Ook het onderhouden van computers en programmatuur en het schrijven van administratieve software valt hieronder. Vaak gebeurt dit in een bedrijfskundige context.",
      "geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]
    },
    { "id": "2", "title": "Domeinklasse", "rol": "ontwerpen", "text": "Neem als uitgangspunt alle use case scenario's of ieder document dat beschrijft wat het systeem moet doen (requirementsdocumenten).\nMarkeer door bijv te onderstrepen ieder zelfstandignaamwoord die je kunt vinden is in de verzamelde documenten. Maak je in dit stadium nog geen zorgen over de naamgeving. Dit zijn kandidaten klassen.\nMaak een lijst van de gevonden naamwoorden en rangschik deze naar betekenis. Van de namen die dezelfde betekenis hebben gebruik slechts 1.\nMaak van de gereduceerde lijst een diagram (rechthoek met de naam van de klasse er in).\nTeken de relaties tussen de klassen door een lijn te trekken tussen elke twee klassen die een relatie hebben. Twee klassen hebben een relatie met elkaar als er een zin bestaat (of te maken) waarin die twee klassen voor komen. Met enig kennis over het te maken systeem zijn de relaties redelijk eenvoudig te vinden.\nOm de methodes behorende bij een klasse te vinden, neem je als uitgangspunt dezelfde documenten en ga je nu opzoek naar de werkwoorden (acties) in deze documenten. Dit zijn de kandidaten methoden\nOm te bepalen bij welke klassen deze kandidaten methoden horen stel je de vraag welke klasse is verantwoordelijk voor welke actie. Net als voor de kandidatenklassen rangschik je de acties naar betekenis." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "3", "title": "Toestandsdiagram", "rol": "adviseren", "text": "Een toestandsdiagram (Engels: state diagram en ook wel state transition diagram) is een netwerkdiagram dat een schematische weergave is van een systeem dat als eindigetoestandsautomaat wordt beschouwd. Het diagram toont de verschillende toestanden waarin een systeem zich kan bevinden als cirkels, en de mogelijke overgangen vanuit een toestand naar een andere toestand als pijlen. Deze pijlen worden doorgaans gelabeld met een logische uitspraak die de conditie beschrijft waaronder het systeem van de ene toestand in de andere overgaat. Pijlen kunnen ook gelabeld worden met een kanswaarde (een getal tussen 0 en 1). In dat geval geeft het toestandsdiagram een Markovketen weer.\n\nEen toestandsdiagram kan snel vragen te beantwoorden als \"Kan het systeem als het eenmaal in toestand A is nog wel in toestand B komen? En zo ja, via welke transitiepaden?\" Een transitiepad van A naar B is dan de opeenvolging van toestanden die het systeem moet aannemen om vanuit toestand A in toestand B te komen." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "3", "title": "Domein ICT", "rol": "adviseren", "text": "ICT Domein is een onderwerp wat veel lijkt op domeinklasse gg." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "31", "title": "ERP software", "rol": "realiseren", "text": "ERP software (Enterprise Resource Planning) biedt u een geïntegreerde softwareoplossing voor de ondersteuning van meerdere primaire bedrijfsprocessen, zoals inkoop, voorraadbeheer, verkoop, service, productie en financiële administratie. Door de integratie van administratieve, logistieke, commerciële en financiële processen verbeteren de productiviteit, kostenbeheersing en efficiëntie van uw organisatie. Bekende ERP leveranciers zijn SAP, Microsoft, Oracle en Exact, maar er zijn honderden ERP oplossingen waaruit u kunt kiezen. Meer over de keuze en toepassing van ERP software leest u in de ERP box en in de boeken, whitepapers en overige media die het ICT informatiecentrum in samenwerking met ERP specialisten heeft samengesteld." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "32", "title": "Boekhoudsoftware", "rol": "manage", "text": "Met boekhoudsoftware automatiseert u administratieve processen. Het ICT informatiecentrum biedt u kennis en informatie waarmee u betere keuzes kunt maken en weet hoe u een boekhoudsoftware project optimaal organiseert en uitvoert." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "33", "title": "Blockchain", "rol": "analyseren", "text": "Blockchaintechnologie wordt door velen beschouwd als één van de belangrijkste technologische vernieuwingen na internet. Voor de technologie, die snel bekend is geworden door de opkomst van cryptovaluta, werden veel kansen en toepassingen voorzien voor het bedrijfsleven. Die kansen zijn er nog altijd volop, al neemt het tempo waarin blockchaintoepassingen worden ontwikkeld een beetje af. Lees hier wat blockchain is, wat u ermee kunt, hoe de technologie werkt en wat dit betekent voor uw IT." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "34", "title": "Cloud computing", "rol": "adviseren", "text": "Cloud computing is de verzamelnaam van diverse vormen van dienstverlening waarbij het beheer en onderhoud van bedrijfssoftware, infrastructuren en andere ICT oplossingen door een derde partij worden aangeboden. Als ICT gebruiker heeft u via internet toegang tot de aangeboden dienst. Welke kansen cloud computing uw organisatie biedt, wat de voor- en nadelen zijn, welke onzekerheden er zijn, hoe u risico’s afdekt en wat uw overwegingen kunnen zijn meer gebruik te maken van cloud computing, leest u in de gratis informatie hierover van het ICT informatiecentrum." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]},
    { "id": "35", "title": "Cyber security", "rol": "adviseren", "text": "Cyber security vraagt steeds meer uw aandacht. Nu in toenemende mate criminelen het internet gebruiken om publieke opinies te beïnvloeden, informatiestromen te verstoren, informatie te stelen of via afpersing geld te verdienen, zullen overheden, bedrijven en particulieren zich tegen cybercrime moeten wapenen. Cyber security houdt zich daarmee bezig. Als u de zwakke plekken in uw ICT infrastructuur kent, kunt u deze tijdig aanpakken en schade beperken of voorkomen." ,"geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]}
  ]
}