{
  "id":"gebruikers_interface",
  "name": "Gebruikers Interface",
  "artikelen": [
    { "id": "1", "title": "ICT", "rol": "analyseren", "text": "<b>Informatietechnologie (IT) of informatie- en communicatietechnologie (ICT)</b> is een vakgebied dat zich bezighoudt met informatiesystemen, telecommunicatie en computers. Hieronder valt het ontwikkelen en beheren van systemen, netwerken, databases en websites. Ook het onderhouden van computers en programmatuur en het schrijven van administratieve software valt hieronder. Vaak gebeurt dit in een bedrijfskundige context.",
      "geschiedenis"  : [
      {
        "time": "20:21:30",
        "date": "2020-10-01",
        "editor": {
          "username": "anon123"
        },
        "title": "advice geven",
        "tekst": "test tekst test tekst test tekst"
      },

      {
        "time": "22:10:33",
        "date": "2020-09-28",
        "editor": {
          "username": "anon123"
        },
        "title": "giving advice",
        "tekst": "test tekst test tekst"
      }
    ]
    },
    { "id": "2", "title": "Domeinklasse", "rol": "ontwerpen", "text": "Neem als uitgangspunt alle use case scenario's of ieder document dat beschrijft wat het systeem moet doen (requirementsdocumenten).\nMarkeer door bijv te onderstrepen ieder zelfstandignaamwoord die je kunt vinden is in de verzamelde documenten. Maak je in dit stadium nog geen zorgen over de naamgeving. Dit zijn kandidaten klassen.\nMaak een lijst van de gevonden naamwoorden en rangschik deze naar betekenis. Van de namen die dezelfde betekenis hebben gebruik slechts 1.\nMaak van de gereduceerde lijst een diagram (rechthoek met de naam van de klasse er in).\nTeken de relaties tussen de klassen door een lijn te trekken tussen elke twee klassen die een relatie hebben. Twee klassen hebben een relatie met elkaar als er een zin bestaat (of te maken) waarin die twee klassen voor komen. Met enig kennis over het te maken systeem zijn de relaties redelijk eenvoudig te vinden.\nOm de methodes behorende bij een klasse te vinden, neem je als uitgangspunt dezelfde documenten en ga je nu opzoek naar de werkwoorden (acties) in deze documenten. Dit zijn de kandidaten methoden\nOm te bepalen bij welke klassen deze kandidaten methoden horen stel je de vraag welke klasse is verantwoordelijk voor welke actie. Net als voor de kandidatenklassen rangschik je de acties naar betekenis." },
    { "id": "3", "title": "Toestandsdiagram", "rol": "adviseren", "text": "Een toestandsdiagram (Engels: state diagram en ook wel state transition diagram) is een netwerkdiagram dat een schematische weergave is van een systeem dat als eindigetoestandsautomaat wordt beschouwd. Het diagram toont de verschillende toestanden waarin een systeem zich kan bevinden als cirkels, en de mogelijke overgangen vanuit een toestand naar een andere toestand als pijlen. Deze pijlen worden doorgaans gelabeld met een logische uitspraak die de conditie beschrijft waaronder het systeem van de ene toestand in de andere overgaat. Pijlen kunnen ook gelabeld worden met een kanswaarde (een getal tussen 0 en 1). In dat geval geeft het toestandsdiagram een Markovketen weer.\n\nEen toestandsdiagram kan snel vragen te beantwoorden als \"Kan het systeem als het eenmaal in toestand A is nog wel in toestand B komen? En zo ja, via welke transitiepaden?\" Een transitiepad van A naar B is dan de opeenvolging van toestanden die het systeem moet aannemen om vanuit toestand A in toestand B te komen." }
  ]
}