{
  "id":"software",
  "name": "Software",
  "artikelen": [
    { "id": "10", "title": "HTML", "rol": "analyseren", "text": "HyperText Markup Language (afgekort HTML) is een op SGML gebaseerde opmaaktaal voor de specificatie van documenten, voornamelijk bedoeld voor het wereldwijde web. Het is de standaard opmaaktaal voor webpagina's. Documenten in HTML kunnen geopend en gelezen worden door een webbrowser om vervolgens als webpagina weergegeven te worden. HTML-documenten bevatten op de eerste plaats semantische structuur en tekstuele inhoud van een webpagina; de opmaak en visuele weergave kunnen er ook in worden beschreven, maar daar wordt tegenwoordig gewoonlijk CSS voor gebruikt."},
    { "id": "11", "title": "JavaScript", "rol": "analyseren", "text": "De eerste versie van JavaScript werd in 1995 ontwikkeld door Brendan Eich van Netscape Communications Corporation voor gebruik in Netscape Navigator. Aanvankelijk was de naam Mocha en vervolgens LiveScript. De taal werd hernoemd tot JavaScript in de tijd dat in de Netscape-browser ook ondersteuning voor Java-applets werd ingebouwd.\n\nMet de introductie van JavaScript ontstonden de eerste mogelijkheden om webpagina's interactief te maken. Dit werd later Dynamic HTML genoemd.\n\nNetscape heeft in een poging om JavaScript als een officiële norm erkend te krijgen en er toch zelf voldoende zeggingskracht over te behouden de taal laten normeren door de European Computer Manufacturers Association (ECMA), waarbij de naam om redenen betreffende het merkrecht is gewijzigd in ECMAScript. De relevante ISO-standaard is ISO 16262 (Internationale Organisatie voor Standaardisatie). De huidige versie van JavaScript is versie ECMAScript 2018 (juni 2018).\n\nMicrosoft heeft een eigen implementatie van JavaScript ontwikkeld onder de naam JScript en Adobe heeft een eigen versie genaamd ActionScript die gebruikt wordt in Flash."},
    { "id": "12", "title": "Hibernate", "rol": "analyseren", "text": "Hibernate is een ORM-bibliotheek voor Java. Het is een opensourceframework dat beschikbaar is onder de LGPL. Hibernate werd gemaakt door een internationaal team van Java-ontwikkelaars. Het is een eenvoudig te gebruiken framework voor het koppelen van een objectgeoriënteerd domeinmodel aan een traditionele relationele database.\n\nHibernate zorgt voor de koppeling van Java-klassen aan databasetabellen (en voor het koppelen van Java-datatypes aan SQL-datatypes). Het zorgt ook voor de ophaalfuncties, wat het ontwikkeltraject aanmerkelijk kan verkorten. De ontwikkelaar hoeft zich met dit framework niet meer bezig te houden met SQL- en JDBC-verbindingen.\n\nHet doel van Hibernate is de ontwikkelaar zo veel mogelijk te vrijwaren van programmeertaken die gerelateerd zijn aan het vastleggen van gegevens. Hibernate is eenvoudig in een project te incorporeren, of dit nu een nieuwe ontwikkeling of het ontsluiten van een bestaand systeem betreft. Hibernate genereert de benodigde SQL-instructies en de ontwikkelaar hoeft geen code op te nemen voor de verwerking van de resultaten en de conversie van gegevenstypes. Daardoor kan een applicatie worden ontwikkeld die eenvoudig portable is te maken naar alle SQL-databases."}
  ]
}